app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-09-24 16:03:55.849063"], ["updated_at", "2018-09-24 16:03:55.849063"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class))
    @school_class.save